In [19]:
import pandas as pd
data_person = {
    "id": [1, 2, 3],
    "email": ["john@example.com", "bob@example.com", "john@example.com"]
}

In [20]:
df = pd.DataFrame(data_person)
df

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [15]:
df_merged = df.merge(df, how='left',on='email')
df_merged

   id_x             email  id_y
0     1  john@example.com     1
1     1  john@example.com     3
2     2   bob@example.com     2
3     3  john@example.com     1
4     3  john@example.com     3

In [17]:
df_filtered = df_merged[df_merged['id_x'] > df_merged['id_y']]
df_filtered

   id_x             email  id_y
3     3  john@example.com     1

In [18]:
df.drop(df[df['id'].isin(df_filtered['id_x'])].index, inplace=True)
df

   id             email
0   1  john@example.com
1   2   bob@example.com

In [33]:
# Second way, using groupby
df = pd.DataFrame(data_person)
df

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [34]:
df.groupby('email')['id'].min()

email
bob@example.com     2
john@example.com    1
Name: id, dtype: int64

In [35]:
min_id = df.groupby('email')['id'].transform('min')
min_id

0    1
1    2
2    1
Name: id, dtype: int64

In [36]:
df_filtered = df[df['id'] != min_id] 
df_filtered

   id             email
2   3  john@example.com

In [37]:
df.drop(df_filtered.index, inplace=True)

In [38]:
df

   id             email
0   1  john@example.com
1   2   bob@example.com